# 1️⃣ 📜 შექმენი სია:
# შექმენით სია, რომელიც შეიცავს 10 ელემენტს, მაგალითად: ნივთები, სახელები ან რიცხვები. 🧩 აირჩიე 10 ისეთი რამ, რაც გინდა, რომ იყოს სიაში!
anything = ['lobiani', 'shaurma', 'yava', 'mcxeta', 'batumi', 'html', 'gave dev','web dev', 'goa', 'mziko']
print(anything)
# 2️⃣ list = [17,2,3,4,10,6,100,8,9,11] 
# მოცემულია სია რომელიც წერია არასწორად თქვენი დავალებაა რომ შეასწოროთ ის 
list = [17,2,3,4,10,6,100,8,9,11]
list[0] = 1
list[4] = 5
list[6] = 7
list[9] = 10
print(list)
# 3️⃣ 🔄 შემოიტანეთ რიცხვების სია და  დაბეჭდეთ ელემენტები მესამე და მეშვიდე ინდექს შორის
num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(num[3:7])

# 4️⃣ 🏁 დაბეჭდეთ ბოლო სამი ელემენტი:
# თქვენი სიის ბოლო სამი ნივთი! 🌟 
things = ['lobiani', 'shaurma', 'yava', 'mcxeta', 'batumi', 'html', 'gave dev','web dev', 'goa', 'mziko']
print(things[6:9])

# 5️⃣ ამიხსენით list და indexing კომენატრებით 📝
#list - გამოიყენება იმისთვის რომ გავაკეთოთ ჩვენი სასურველი სია,შეგვიძლია გავაკეთოთ სია ესე print('ragac) და გავამეოროთ print რამოდენიმეჯერ მაგრამ ეს ძნელი ხერხია ამიტომ შემოიღეს გამარტივებული კოდი list = ['...']
#indexing გამოიყენება იმისთვის რომ ლისთი შევცვალოთ, ანუ რაიმე ელემენტი შევცვალოთ სხვა რაიმე ელემენტად,მაგალითად list = [1,3,3,4] სამიანის ადგილას უნდა იყოს ორიანი მაგრამ შეგვიძლია შევცვალოთ ინდექსინგით. list[1] = 2