#1)შექმენით სია, რომელშიც მოცემულია კვირის დღეები:["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"].
#ამოიღეთ და დაბეჭდეთ: კვირის პირველი დღე.ბოლო დღე.
#შეცვალეთ სიის მესამე ელემენტი ("Wednesday") ახალ მნიშვნელობაზე "Midweek".

list = ['monday', 'tuesday', 'wednesday', 'thursday', 'friday', 'seturday', 'sunday']
print(list[1:6])

list[2] = 'midweek'
print(list)

#2)მომხმარებელს სთხოვეთ, რომ შეიყვანოს ხუთი საყვარელი ცხოველის სახელები. სახელები შეინახეთ სიაში.
#მომხმარებლის მიერ შეყვანილი სიის მიხედვით:დაბეჭდეთ პირველი და ბოლო ცხოველის სახელი.შეცვალეთ სიის მეორე ცხოველის სახელი და მომხმარებლისგან მოითხოვეთ ახალი მნიშვნელობა.დაბეჭდეთ განახლებული სია.
list = []
animal= input('enter youre fav 5 animal ')
animal1= input('enter youre fav 5 animal ')
animal2= input('enter youre fav 5 animal ')
animal3= input('enter youre fav 5 animal ')
animal4= input('enter youre fav 5 animal ')
list.append(animal)
list.append(animal1)
list.append(animal2)
list.append(animal3)
list.append(animal4)
print(list)

dif_Animal = input('enter different animal name ')
list.append(dif_Animal)
print(list[2])

#3)შექმენით სია: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12].
#ამოიღეთ სიის ყოველი მესამე ელემენტი. ამოიღეთ სია უკუღმა. სიის შუა 6 ელემენტი გადაიტანეთ ახალ სიაში.

list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
ყოველი_მესამე = list[::3]
შებრუნებული_სია = list[::-1]
შუა = list[3:9]

print('ყოველი მესამე ელემენტი:',ყოველი_მესამე)
print('შებრუნებული სია:',შებრუნებული_სია)
print('შუა:',შუა)

#4)შექმენით სია, რომელიც შეიცავს ათასიდან ათიათასამდე ყველა რიცხვს, რომლებიც იყოფა 500-ზე.
#გამოიყენეთ სლაისინგი, რათა ამოიღოთ:პირველი ხუთი რიცხვი.ყოველი მესამე რიცხვი.დაითვალეთ, რამდენი ელემენტია საბოლოო სიაში.

listn = [1000, 1500, 2000, 2500, 3000, 3500, 4000, 4500, 5000, 5500, 6000, 6500, 7000, 7500, 8000, 8500, 9000, 9500]
first_five = listn[0:5]
third = listn[::3]
new_list = [3500,4500,5000,6000,6500,7500,8000,9000,9500]
print(first_five)
print(third)
print(len(new_list))


#5)მომხმარებელს სთხოვეთ, რომ შეიყვანოს 10 რიცხვი მძიმით გამოყოფილად. შეინახეთ ეს რიცხვები სიაში.
#ამ სიის მიხედვით:ამოიღეთ და დაბეჭდეთ მომხმარებლის შეყვანილი პირველი სამი რიცხვი.სიის შუა ოთხი ელემენტი გადააკოპირეთ ახალ სიაში და დაბეჭდეთ ის.შეამოწმეთ, თუ სიის ბოლო ელემენტი არის ციფრი 10.

