# 2) ახსენით რას ნიშნავს რომ list და string არის დალაგებული მიმდევრობები, კომენტარებით დაწერეთ მათ თვისებებს შორის განსხვავებები. მოიყვანეთ მაგალითები
#ისინი არიან დალაგებული მიმდევრობით,რადგან მათი ინდექსები დალაგებულია

# 3) ახსენით რა არის slicing
# slicing ნიშნავს სექციების ამოჭრას სიიდა

# 4) შექმენით სია რომელშიც ჩამოწერეთ რიცხვებს 1-იდან 20-ის ჩათვლით. slicing-ის საშვალებით გამოიტანეთ რიხცები 5-იდან 10-მდე
numbers = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print(numbers[4:10])
# 5) შექმენით სია ციური სხეულებზე სიტყვებით და შემდეგ გამოიტანეთ მხოლოდ ის ელემენტები, რომლებიც ლუწ ინდექსებზე დგანან
celestial_bodies = ["მზე", "მთვარე", "ვენერა", "მარსი", "იუპიტერი", "სატურნი", "ურანი", "ნეპტუნი", "პლუტონი"]
for i in range(0, len(celestial_bodies), 2):
    print(celestial_bodies[i])

# 6) შექმენით სია 0-დან 15-მდე რიცხვებით. გამოიტანეთ მხოლოდ ის რიცხვები, რომლებიც კენტ ინდექსებზე დგანან
numbers = list(range(16))
for i in range(1, len(numbers), 2):
    print(numbers[i])

# 7) შექმენით string რომელშიც შეინახავთ თქვენს სახელსა და გვარს, შემდეგ ცალ ცალკე გამოიტანეთ ამ სტრინგიდან ჯერ სახელი და შემდეგ გვარი slicing-ის საშვალებით
name  = 'niasimonia'
print(name[0:3])
print(name[3:11])


