#1) for loop-ში გამოიტანეთ რიცხვები 150-დან 202-ის ჩათვლით, ყოველი 2-ე
for i in range(150, 203, 2):
    print(i)
# for loop-ში გამოიტანეთ რიცხვები 400-დან 200-ის ჩათვლით
for i in range(400, 199, -1):
    print(i)

#  თქვენი სიტყვებით ახსენით განსხვავება while და for ციკლებს შორის
#  while გამოიყენება როცა არ ვიცით რამდენჯერ უნდა შესრულდეს ციკლი, მაგრამ გვაქვს გარკვეული პირობა რომლის დაკმაყოფილების შემთხვევაში გაგრძელდება ფუნქციონირება.

# for იმისთვის გამოიყენება, როცა წინასწარ ვიცით, რამდენჯერ უნდა შესრულდეს ციკლი, ან როცა რაღაც კოლექციის მაგალითად დიაპაზონი სია და სტრიქონის გავლა გვჭირდება.

 #დაბეჭდეთ "GOA BEST!!!" 50-ჯერ, ორივე ციკლით შეასრულეთ ეს დავალება
for i in range(50):
    print('GOA BEST')

#გამოიყენეთ while loop_ი რომ, დაპრინტოთ ლუწი რიცხვები  1-დან 20-მდე
num = 2
while num <= 20:
    print(num)
    num += 2
