#<aside> - მთავარი ინფორმაციის გვერდით წერია,ეგეც ინფორმაციაა მარა მთავარზე განსხვავებული და პატარაა
#<section> - სექცია არის თავში და გეხმარება იმისთვის რომ ადვილად გადახვიდე იმ ნაწილზე რომელზეც გინდა
#<article> - არტიკლში არიც მცირე ინფორმაცია და ფოტოთი მიგვანიშნებს რა ხდება
#<header> - ნაწილია რომელიც მაღლა იწერება ის რაც ჩვენ გვინდა(მაგ.სექცია ნაგივაცია და ას.შ)
#<main> - აქ იწერება მნიშნელოვანი ინფორმაცია
#<footer> - იწერება საიტის დაბლა,სულ მცირე ინფორმაცია საიტის შესახებ(უფრო მის შემქმნელზე,თუ როგორ დავუკავშირდეთ)

# სემანტიკური  თეგის მაგალითბი

# <header> - გვერდის ან სექციის სათაურისთვის.
# <nav> - ნავიგაციის ბლოკისთვის.
# <article> - დამოუკიდებელი შინაარსის სექციებისთვის, როგორიცაა სტატია.
# <section> - შინაარსის ლოგიკური განყოფილებისთვის.
# <footer> - გვერდის ან სექციის დასასრულისთვის.
