#მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ ამ რიცხვის თითოეული ციფრი

number = "117"

for i in number:
    print(i)

#მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ რიცხვები მომხმარებლის შემოტანილი რიცხვიდან 0-მდე

num = '100'
i = 0
while i<200:
    print(i)
    i = i + 1

#while ციკლით გამოიტანეთ მხოლოდ კენტი რიცხვები

i = 1
while i < 101:
    print(i)
    i = i + 2

#for ციკლით გამოიტანეთ მხოლოდ ლუწი რიცხვები

number = 100
for i in range (0,100,2):
    print(i)

#კომენტარის სახით ახსენით როგორ მუშაობს for/while ციკლები და რა არის საიტერაციო ცვლადი
#Საიტერაციო ცვლადი სრის ცვლსდი რომელსაც ციკლის დროს ვწმნით, მაგალითად:for i in range (5),მ შემთხვევაშკ i არის საიტერაციო ცვლადი
