# 1) შექმენით სია რომელშიც ჩამოწერეთ თქვენთვის სასურველ 15 დადებით რიცხვს, შემდეგ ამ სიას გადაუარეთ for ციკლით და if-ის საშვალებით შეამოწმეთ თითოეული რიცხვი ლუწია თუ კენტი, დათვალეთ ლუწი რიცხვების რაოდენობა even ცვლადში რომელიც თავიდან იქნება 0, ხოლო ანალგოიურად დათვალეთ კენტი რიცხვები odd ცვლადით. საბოლოოდ ტერმინალში გასაგებად გამოიტანეთ თუ რადენი ლუწი და რამდენი კენტი რიცხვია მოცემულ სიაში
numbers = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
even = 0
odd = 0
for numbers in numbers:
    if numbers % 2 == 0:
        even += 1
    else:
        odd += 1
print(even)
print(odd)