# 1) კომენტარის სახით ახსენით რა არის ფუნქცია და რაში გამოიყენება იგი.

# ფუნქცია - არის კოდის ბლოკი რომელიც შეგვიძ₾ია გამოვიძახოთ რამდენჯერაც ჩვენ გვინდა.

# 2) შექმენით ფუნქცია რომელსაც ექნება ერთი პარამეტრი "სახელი" და მიესალმეთ მომხმარებელს
def greet(a,b):
    return a + ' ' + b
print(greet('gamarjoba','rogor xar?'))


# 2) შექმენით სია რომელშიც 
# შეინახავთ თქვენთვის სასრუველ 5 სახელს, შემდეგ შექმენით
#  ფუნქცია რომლის საშუალებითაც მომხმარებელს ეტყვით შემოიყვანოს 
# თავისი სახელი და ეს სახელი დაამატეთ შექმნილ სიაში 

list = ['niako','tamo','andria','sandro','vano']
name1 = input('enter your name: ')
print(list.append(name1))

# 3) შექმენით სია სადაც შეინახავთ 5 სახელს. 
# შემდეგ მომხმარებელს შემოატანინეთ სახელი და ინდექსი თუ ინდექსი 
# აღემატება სიის რაოდენობას დააბრუნეთ ერორი სტრინგის სახით სხვაშემთხვევაში
#  დაამატეთ სიაში
names = ["Ana", "Nikolozi", "Saba", "Mari", "Luka"]
name4 = input("Enter a name: ")
indeqsi = int(input("Enter a index: "))
if indeqsi > len(names):
    print("Error")
else:
    names.insert(indeqsi, name4)
    print(names)
