# 1️⃣ თქვენი სიტყვებით ახსენით განსხვავება while და for ციკლებს შორის
#  while გამოიყენება როცა არ ვიცით რამდენჯერ უნდა შესრულდეს ციკლი, მაგრამ გვაქვს გარკვეული პირობა რომლის დაკმაყოფილების შემთხვევაში გაგრძელდება ფუნქციონირება.
# for იმისთვის გამოიყენება, როცა წინასწარ ვიცით, რამდენჯერ უნდა შესრულდეს ციკლი, ან როცა რაღაც კოლექციის მაგალითად დიაპაზონი სია და სტრიქონის გავლა გვჭირდება.


# 2️⃣ დაბეჭდეთ "GOA BEST!!!" 100-ჯერ, ორივე ციკლით შეასრულეთ ეს დავალება

for i in range(1 ,100):
    print('goa best!')

# 🌀 while ციკლის დავალებები

# 3️⃣ რიცხვების დათვლა
# დაწერე პროგრამა, რომელიც while ციკლით დაბეჭდავს რიცხვებს 10-დან 1-მდე უკუღმა.
num = 10 
while num >= 1:
    print(num)
    num -= 1  
# 4️⃣რიცხვების ჯამი
# დაწერე პროგრამა, რომელიც while ციკლით დაითვლის რიცხვების ჯამს 1-დან 50-მდე.
num = 1 
total = 0 

while num <= 50:
    total += num  
    num += 1 

print("რიცხვების ჯამი 1-დან 50-მდე:", total)

# 🔄 for ციკლის დავალებები

# 5️⃣სიის ელემენტების დათვლა
# მოცემულია სია: names = ["ნიკა", "თეო", "ანა", "გიო"].
# დაწერე პროგრამა, რომელიც for ციკლით დაბეჭდავს ამ სიაში რამდენი სახელი არის.
names = ["ნიკა", "თეო", "ანა", "გიო"]
count = 0 
for name in names:
    count += 1 
print("სიის ელემენტების რაოდენობა:", count)
# 6️⃣მრავალჯერადი დაბეჭდვა
# დაწერე პროგრამა, რომელიც for ციკლით 7-ჯერ დაბეჭდავს ტექსტს: “მე მიყვარს პროგრამირება”.
for i in range(1, 8):
    print('მე მიყვარს პროგრამირება')