# 2) მომხმარებელს შემოატანინეთ სიტყვა, შემდეგ slicing-ის დახმარებით if-ით შეამოწმეთ ეს სიტყვა თუ იგივე როდესაც შემოაბრუნებთ თუ იგივეა დაბეჭდეთ რომ განსაკუთრებული (ასეთ სიტყვებს palindrome ჰქვია) სიტყვაა, სხვა შემთხვევაში კი დაბეჭდეთ რომ ჩვეულებრივი სიტყვაა.
word = input("enter ur word: ")
if word == word[::-1]: 
    print("(Palindrome)")
else:
    print("this is norm word")
# 3) შექმენით სიტყვების სია, შემდეგ მას გადაუარეთ for ციკლით, დაბეჭდეთ ყოველი ელემენტი ოღონდ ყოველი მეორე (რომ გაიგოთ ყოველი მეორე აიღეთ ცვლადი რომელიც თავიდან 0 იქნება, ყოველ გამეორებაზე კი გაზრდით ერთით და შეამოწმეთ ლუწია თუ კენტი) უნდა იყოს შემობრუნებული
words = ["მზე", "მთვარე", "ვარსკვლავი", "პლანეტა", "კოსმოსი", "ატომი"]
i = 0
for word in words:
    if i % 2 == 0:
        print(word)
    else:
        print(word[::-1])
    i += 1
# 4) მომხმარებელს შემოატანინეთ სიტყვა და დაბეჭდეთ ის შებრუნებულად
print(word[::-1])

# 5) შექმენით ცვლადი რომელშიც შეინახავთ თქვენთვის სასურველ string-ს, უნდა იყოს მინიმუმ 20 სიმბოლო, შემდეგ slicing-ის საშვალებით დაბეჭდეთ ეს string ხუთგვარად შემდეგი პირობებით:
# ვქმნით ცვლადს მინიმუმ 20 სიმბოლოს მქონე სტრინგით
text = "დავიწყოთ პითონით სწავლა ახლავე!"
print(text[:5])
print(text[-4:])
print(text[3:10])
print(text[::-1])
print(text[::2])
